#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2020/4/16 21:36
# @Author  : Fhh
# @File    : 36.py
# Good good study,day day up!
"""
判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。

数字 1-9 在每一行只能出现一次。
数字 1-9 在每一列只能出现一次。
数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。"""


class Solution:
    def isValidSudoku(self, board):
        """
        :param board:list[list[int]]
        :return:
        """
        blocks = []  # 每个3X3方块点的集合
        for i in [1, 4, 7]:
            for j in [1, 4, 7]:
                tmp = []
                for x in range(i - 1, i + 2):
                    for y in range(j - 1, j + 2):
                        tmp.append(board[x][y])
                blocks.append(tmp)
        colunms = list(zip(*board))  # 列
        for i in range(9):
            if len(set(board[i])) != 9 - board[i].count('.') + 1 \
                    or len(set(colunms[i])) != 9 - colunms[i].count('.') + 1 \
                    or len(set(blocks[i])) != 9 - blocks[i].count('.') + 1:
                return False
        return True


s = Solution()
a = [
    ["5", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"]
]
b = [
    ["8", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"]
]
print((s.isValidSudoku(a)))
print((s.isValidSudoku(b)))
